Управление_по_целям_и_KPI/src/Documents/KPI_ПриказОПереводе/KPI_ПриказОПереводе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>KPI_ПриказОПереводе</name>
  <registerRecords>InformationRegister.KPI_ГрафикиРаботыСотрудников</registerRecords>
  <registerRecords>InformationRegister.KPI_ПлановыеНачисления</registerRecords>
  <attributes>
    <name>ИзменятьКвалификацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>СтараяДолжность</name>
      <type>
        <types>CatalogRef.KPI_СтруктураКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктураКомпании</name>
      <type>
        <types>CatalogRef.KPI_СтруктураКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.KPI_Квалификации</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.KPI_ГрафикиРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПлановыеНачисления</name>
    <attributes>
      <name>СтруктураКомпании</name>
      <type>
        <types>CatalogRef.KPI_СтруктураКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.KPI_Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_по_целям_и_KPI/src/InformationRegisters/KPI_ПлановыеНачисления/KPI_ПлановыеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>KPI_ПлановыеНачисления</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.KPI_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Начисление</name>
    <type>
      <types>ChartOfCalculationTypesRef.KPI_Начисления</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_по_целям_и_KPI/src/InformationRegisters/KPI_ГрафикиРаботыСотрудников/KPI_ГрафикиРаботыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>KPI_ГрафикиРаботыСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.KPI_ГрафикиРабот</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.KPI_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_по_целям_и_KPI/src/InformationRegisters/KPI_СтруктураКомпании/KPI_СтруктураКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>KPI_СтруктураКомпании</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.KPI_Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СкрытьВСтруктуре</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтруктураУдалена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>СтруктураКомпании</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_по_целям_и_KPI/src/Catalogs/KPI_Сотрудники/KPI_Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>KPI_Сотрудники</name>
  <attributes>
    <name>СтруктураКомпании</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Квалификация</name>
    <type>
      <types>CatalogRef.KPI_Квалификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

Управление_по_целям_и_KPI/src/Documents/KPI_ПриказОПереводе/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.KPI_ПлановыеНачисления.Записать();
	Движения.KPI_ПлановыеНачисления.Записывать = Истина;
	Движения.KPI_ГрафикиРаботыСотрудников.Записать();
	Движения.KPI_ГрафикиРаботыСотрудников.Записывать = Истина;
	
	ОбработкаУдаленияПроведения(Отказ);          
	КритерийПоиска       = Новый Структура("СтруктураКомпании");
	Для каждого Строка Из Сотрудники Цикл
		//Проверка на занятость должности сотрудником
		Сотрудник = KPI_ОбщегоНазначенияСервер.ПолучитьСотрудникаПоСтруктуреКомпанииНаДату(Строка.СтараяДолжность, Дата);
		Если Не ЗначениеЗаполнено(Сотрудник) Тогда      			
			Сообщить("Сотрудник " + Сотрудник.ФизическоеЛицо + " не занимает должность """ + Строка.СтараяДолжность.Должность + """ на данную дату");
			УдалитьПроведение = Истина;			
		Иначе
			//Проверка на возможность проведения задним числом
			Если НачалоДня(Дата) >= НачалоДня(ТекущаяДата()) Или KPI_ОбщегоНазначенияСервер.ПроверкаНаВозможностьПроведенияЗаднимЧислом(Строка.СтараяДолжность, Дата, Истина) Тогда
				УдалитьПроведение = Ложь;
			Иначе
				УдалитьПроведение = Истина;
				Сообщить("Проведение задним числом невозможно, т.к. существуют документы снятия с должности """ + Строка.СтараяДолжность.Должность + """ на более позднюю дату (Строка №" + Строка.НомерСтроки + ")");
			КонецЕсли;
		КонецЕсли;	
		
		
		СотрудникНов = KPI_ОбщегоНазначенияСервер.ПолучитьСотрудникаПоСтруктуреКомпанииНаДату(Строка.СтруктураКомпании, Дата);
		//Проверка на занятость должности сотрудником
		//Проверка на занятость должности сотрудником
		Если Не ИзменятьКвалификацию И Строка.СтараяДолжность = Строка.СтруктураКомпании  Тогда 
			Сообщить("Нельзя назначать сотрудника на должность уже занимаемую им без смены квалификации (Строка №" + Строка.НомерСтроки + ")");
			УдалитьПроведение = Истина;
		ИначеЕсли ЗначениеЗаполнено(СотрудникНов) и (Сотрудник <>  СотрудникНов)  Тогда      			
			Сообщить("Должность """ + Строка.СтруктураКомпании.Должность + """ уже занята другим сотрудником");
			УдалитьПроведение = Истина;
			
		Иначе	
			//Проверка на возможность проведения задним числом
			Если НачалоДня(Дата) >= НачалоДня(ТекущаяДата()) Или KPI_ОбщегоНазначенияСервер.ПроверкаНаВозможностьПроведенияЗаднимЧислом(Строка.СтруктураКомпании, Дата) Тогда
				УдалитьПроведение = Ложь;
			Иначе
				УдалитьПроведение = Истина;
				Сообщить("Проведение задним числом невозможно, т.к. существуют документы назначения на должность """ + Строка.СтруктураКомпании.Должность + """ на более позднюю дату (Строка №" + Строка.НомерСтроки + ")");
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла;
	
	//Движения по РС
	Если Не УдалитьПроведение Тогда
		Для каждого Строка Из Сотрудники Цикл
			СтарыйСотрудник = KPI_ОбщегоНазначенияСервер.ПолучитьСотрудникаПоСтруктуреКомпанииНаДату(Строка.СтараяДолжность,Дата-1);
			//////Увольнение
			Запись = РегистрыСведений.KPI_СтруктураКомпании.СоздатьМенеджерЗаписи();
			Запись.СтруктураКомпании = Строка.СтараяДолжность;
			Запись.Период = Дата-1;
			Запись.Прочитать();
			Запись.СтруктураКомпании = Строка.СтараяДолжность;
			Запись.Уволен = Истина;
			Запись.Сотрудник = СтарыйСотрудник;
			Запись.Период = Дата-1;
			Запись.Записать();  
			
			//Делаем запись о пустом структурном подразделении
			Запись = РегистрыСведений.KPI_СтруктураКомпании.СоздатьМенеджерЗаписи();
			Запись.СтруктураКомпании = Строка.СтараяДолжность;
			Запись.Период = Дата;
			Запись.Уволен = Ложь;
			Запись.Период = Дата;
			Запись.Записать(); 

			//закроем начисления по уволеному сотруднику
			Начисления = KPI_ИнтерфейсВызовСервера.СрезПлановыхНачисленийОбъектаУправления(Дата,СтарыйСотрудник,Ложь);
			
			Пока Начисления.Следующий() Цикл
				Движение                = Движения.KPI_ПлановыеНачисления.Добавить();
				Движение.Период         = Дата;
				Движение.Сотрудник      = СтарыйСотрудник;
				Движение.ДатаОкончания  = Дата;
				Движение.Начисление     = Начисления.ВидНачисления;
			КонецЦикла;
			
			//////Прием
			
			Сотрудник = Справочники.KPI_Сотрудники.СоздатьЭлемент();
			Сотрудник.СтруктураКомпании = Строка.СтруктураКомпании;
			Сотрудник.ФизическоеЛицо    = СтарыйСотрудник.ФизическоеЛицо;
			Сотрудник.Квалификация      = ?(ИзменятьКвалификацию и ЗначениеЗаполнено(Строка.Квалификация), Строка.Квалификация,  СтарыйСотрудник.Квалификация);
			Сотрудник.Наименование      = Строка.СтруктураКомпании.Наименование + " (" + СтарыйСотрудник.ФизическоеЛицо + ")";
			Сотрудник.Записать();
			
			//Делаем запись о приеме сотрудника
			Запись = РегистрыСведений.KPI_СтруктураКомпании.СоздатьМенеджерЗаписи();
			Запись.СтруктураКомпании = Строка.СтруктураКомпании;
			Запись.Период            = Дата;
			Запись.Прочитать();
			Запись.СтруктураКомпании = Строка.СтруктураКомпании;
			Запись.Уволен            = Ложь;
			Запись.Сотрудник         = Сотрудник.Ссылка;
			Запись.Период            = Дата;
			Запись.Записать(); 
			
			Движение              = Движения.KPI_ГрафикиРаботыСотрудников.Добавить();
			Движение.Период       = Дата;
			Движение.Сотрудник    = Сотрудник.Ссылка;
			Движение.ГрафикРаботы = Строка.ГрафикРаботы;
			
			
			КритерийПоиска.СтруктураКомпании = Строка.СтруктураКомпании;
			НачисленияСотрудника = ПлановыеНачисления.НайтиСтроки(КритерийПоиска);
			
			Для Каждого НачислениеСотрудника из НачисленияСотрудника Цикл
				Движение                     = Движения.KPI_ПлановыеНачисления.Добавить();
				Движение.Активность          = Истина;
				Движение.Период              = Дата;
				Движение.Регистратор         = Ссылка;
				Движение.Сотрудник           = Сотрудник.Ссылка;
				Движение.Начисление          = НачислениеСотрудника.Начисление;
				Движение.Сумма               = НачислениеСотрудника.Сумма;
				Движение.ДатаНачала          = Дата;
			КонецЦикла;
			
			
			КриптоМодуль = KPI_ОбщегоНазначенияСервер.ПолучитьКриптоМодуль();
			КриптоМодуль.ЗадатьСопоставлениеСотрудникПользователь(Сотрудник,СтарыйСотрудник.ИдентификаторПользователяИБ);
			
		КонецЦикла;	
	КонецЕсли;
	
	Если УдалитьПроведение Тогда
		ЭтотОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Для каждого Строка Из Сотрудники Цикл
		
		//////Увольнение
		//Удаляем записи об увольнении сотрудника
		Запись = РегистрыСведений.KPI_СтруктураКомпании.СоздатьМенеджерЗаписи();
		Запись.СтруктураКомпании = Строка.СтараяДолжность;
		Запись.Период = Дата-1;
		Запись.Прочитать();
		Запись.Удалить();  
		
		//Удаляем записи о пустом структурном подразделении
		Запись = РегистрыСведений.KPI_СтруктураКомпании.СоздатьМенеджерЗаписи();
		Запись.СтруктураКомпании = Строка.СтараяДолжность;
		Запись.Период = Дата;
		Запись.Прочитать();
		Запись.Удалить();
		
		//////Прием
		Запись = РегистрыСведений.KPI_СтруктураКомпании.СоздатьМенеджерЗаписи();
		Запись.СтруктураКомпании = Строка.СтруктураКомпании;
		Запись.Период = Дата;
		Запись.Прочитать();
		Запись.Удалить();

		
	КонецЦикла;		
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Ответственный = ПараметрыСеанса.KPI_ТекущийСотрудник.СтруктураКомпании;
	
КонецПроцедуры
